#Задание 5.1
str = input("Введите текст:").replace("абв","")
print("Текст без 'абв':",str)